In [4]:
import pandas as pd

In [6]:
df = pd.read_csv('emp_info.csv')

In [7]:
df

   emp_id first_name last_name             email
0       1       John         M     J@company.com
1       2       Jane       K-J  Jane@company.com
2       3        Tom         G     T@company.com

In [9]:
df_xl = df.to_excel('emp.xlsx')

In [10]:
new_df = pd.read_excel('emp.xlsx')

In [11]:
new_df

   Unnamed: 0  emp_id first_name last_name             email
0           0       1       John         M     J@company.com
1           1       2       Jane       K-J  Jane@company.com
2           2       3        Tom         G     T@company.com